; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.udphdr = type { i16, i16, i16, i16 }
%struct.dnshdr = type { i16, i16, i16, i16, i16, i16 }

@morton_filter = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 64, i32 1, i32 0 }, section "maps", align 4, !dbg !0
@__const.xdp_morton_filter_func.____fmt = private unnamed_addr constant [18 x i8] c"drop in eth proto\00", align 1
@__const.xdp_morton_filter_func.____fmt.1 = private unnamed_addr constant [21 x i8] c"drop in udp,proto=%u\00", align 1
@__const.xdp_morton_filter_func.____fmt.2 = private unnamed_addr constant [6 x i8] c"fp:%u\00", align 1
@__const.xdp_morton_filter_func.____fmt.3 = private unnamed_addr constant [20 x i8] c"error in map lookup\00", align 1
@__const.xdp_morton_filter_func.____fmt.5 = private unnamed_addr constant [9 x i8] c"found:%u\00", align 1
@__const.xdp_morton_filter_func.____fmt.6 = private unnamed_addr constant [15 x i8] c"found index:%u\00", align 1
@__const.xdp_morton_filter_func.____fmt.7 = private unnamed_addr constant [9 x i8] c"failure\0A\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !69

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/anastasia/diplomatiki/xdp_code/filters")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 40, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48, !51, !7, !53}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!54 = !{!0, !55, !59, !61, !63, !65, !67, !69, !74, !137, !139, !147}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!56 = distinct !DIGlobalVariable(name: "NO_BLOCKS", scope: !2, file: !57, line: 6, type: !58, isLocal: true, isDefinition: true)
!57 = !DIFile(filename: "./morton_filter.h", directory: "/home/anastasia/diplomatiki/xdp_code/filters")
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression(DW_OP_constu, 64, DW_OP_stack_value))
!60 = distinct !DIGlobalVariable(name: "BUCKETS_PER_BLOCK", scope: !2, file: !57, line: 7, type: !58, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!62 = distinct !DIGlobalVariable(name: "OTA_BITS", scope: !2, file: !57, line: 8, type: !58, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_constu, 368, DW_OP_stack_value))
!64 = distinct !DIGlobalVariable(name: "FSA_ARRAY_END", scope: !2, file: !57, line: 12, type: !58, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression(DW_OP_constu, 128, DW_OP_stack_value))
!66 = distinct !DIGlobalVariable(name: "FCA_ARRAY_END", scope: !2, file: !57, line: 13, type: !58, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!68 = distinct !DIGlobalVariable(name: "FCA_BITS", scope: !2, file: !57, line: 9, type: !58, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 450, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 4)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "stdin", scope: !2, file: !76, line: 137, type: !77, isLocal: false, isDefinition: false)
!76 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!82 = !{!83, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !99, !101, !102, !103, !106, !107, !109, !113, !116, !120, !123, !126, !127, !128, !132, !133}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !84, size: 32)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !51, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !51, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !51, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !51, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !51, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !51, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !51, size: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !51, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !51, size: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !51, size: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !51, size: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !97, size: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !100, size: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !84, size: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !84, size: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !104, size: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 152, baseType: !47)
!105 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !50, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 153, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !105, line: 47, baseType: !119)
!119 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !121, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !124, size: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !100, size: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !46, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !129, size: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 46, baseType: !131)
!130 = !DIFile(filename: "/usr/lib/clang/13.0.0/include/stddef.h", directory: "")
!131 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !84, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "stdout", scope: !2, file: !76, line: 138, type: !77, isLocal: false, isDefinition: false)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !141, line: 152, type: !142, isLocal: true, isDefinition: true)
!141 = !DIFile(filename: "../libbpf/src/build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/anastasia/diplomatiki/xdp_code/filters")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!84, !145, !53, null}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !141, line: 33, type: !149, isLocal: true, isDefinition: true)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!46, !46, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !155, line: 33, size: 160, elements: !156)
!155 = !DIFile(filename: "../libbpf/src/build/usr/include/bpf/bpf_helpers.h", directory: "/home/anastasia/diplomatiki/xdp_code/filters")
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !154, file: !155, line: 34, baseType: !7, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !154, file: !155, line: 35, baseType: !7, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !154, file: !155, line: 36, baseType: !7, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !154, file: !155, line: 37, baseType: !7, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !154, file: !155, line: 38, baseType: !7, size: 32, offset: 128)
!162 = !{i32 7, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{i32 7, !"frame-pointer", i32 2}
!166 = !{!"clang version 13.0.0"}
!167 = distinct !DISubprogram(name: "xdp_morton_filter_func", scope: !3, file: !3, line: 55, type: !168, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !178)
!168 = !DISubroutineType(types: !169)
!169 = !{!84, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !172)
!172 = !{!173, !174, !175, !176, !177}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !6, line: 2857, baseType: !53, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !171, file: !6, line: 2858, baseType: !53, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !171, file: !6, line: 2859, baseType: !53, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !171, file: !6, line: 2861, baseType: !53, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !171, file: !6, line: 2862, baseType: !53, size: 32, offset: 128)
!178 = !{!179, !180, !181, !182, !196, !203, !222, !229, !238, !252, !253, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !280, !281, !282, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !297, !302, !303, !304, !305, !306, !318, !323, !326, !327, !328, !329, !330, !331, !333, !338, !339, !340, !341, !342, !343, !349, !353}
!179 = !DILocalVariable(name: "ctx", arg: 1, scope: !167, file: !3, line: 55, type: !170)
!180 = !DILocalVariable(name: "data_end", scope: !167, file: !3, line: 61, type: !46)
!181 = !DILocalVariable(name: "data", scope: !167, file: !3, line: 62, type: !46)
!182 = !DILocalVariable(name: "eth", scope: !167, file: !3, line: 63, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !185, line: 165, size: 112, elements: !186)
!185 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!186 = !{!187, !192, !193}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !184, file: !185, line: 166, baseType: !188, size: 48)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 48, elements: !190)
!189 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!190 = !{!191}
!191 = !DISubrange(count: 6)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !184, file: !185, line: 167, baseType: !188, size: 48, offset: 48)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !184, file: !185, line: 168, baseType: !194, size: 16, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !195, line: 25, baseType: !48)
!195 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!196 = !DILocalVariable(name: "____fmt", scope: !197, file: !3, line: 73, type: !200)
!197 = distinct !DILexicalBlock(scope: !198, file: !3, line: 73, column: 3)
!198 = distinct !DILexicalBlock(scope: !199, file: !3, line: 72, column: 42)
!199 = distinct !DILexicalBlock(scope: !167, file: !3, line: 72, column: 6)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 144, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 18)
!203 = !DILocalVariable(name: "iph", scope: !167, file: !3, line: 78, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !206, line: 86, size: 160, elements: !207)
!206 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!207 = !{!208, !210, !211, !212, !213, !214, !215, !216, !217, !219, !221}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !205, file: !206, line: 88, baseType: !209, size: 4, flags: DIFlagBitField, extraData: i64 0)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !189)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !205, file: !206, line: 89, baseType: !209, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !205, file: !206, line: 96, baseType: !209, size: 8, offset: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !205, file: !206, line: 97, baseType: !194, size: 16, offset: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !205, file: !206, line: 98, baseType: !194, size: 16, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !205, file: !206, line: 99, baseType: !194, size: 16, offset: 48)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !205, file: !206, line: 100, baseType: !209, size: 8, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !205, file: !206, line: 101, baseType: !209, size: 8, offset: 72)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !205, file: !206, line: 102, baseType: !218, size: 16, offset: 80)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !195, line: 31, baseType: !48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !205, file: !206, line: 103, baseType: !220, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !195, line: 27, baseType: !53)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !205, file: !206, line: 104, baseType: !220, size: 32, offset: 128)
!222 = !DILocalVariable(name: "____fmt", scope: !223, file: !3, line: 88, type: !226)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 88, column: 3)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 87, column: 35)
!225 = distinct !DILexicalBlock(scope: !167, file: !3, line: 87, column: 6)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 168, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 21)
!229 = !DILocalVariable(name: "udph", scope: !167, file: !3, line: 92, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !232, line: 23, size: 64, elements: !233)
!232 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!233 = !{!234, !235, !236, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !231, file: !232, line: 24, baseType: !194, size: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !231, file: !232, line: 25, baseType: !194, size: 16, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !231, file: !232, line: 26, baseType: !194, size: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !231, file: !232, line: 27, baseType: !218, size: 16, offset: 48)
!238 = !DILocalVariable(name: "dnsh", scope: !167, file: !3, line: 108, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dnshdr", file: !241, line: 29, size: 96, elements: !242)
!241 = !DIFile(filename: "./dns.h", directory: "/home/anastasia/diplomatiki/xdp_code/filters")
!242 = !{!243, !247, !248, !249, !250, !251}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !240, file: !241, line: 30, baseType: !244, size: 16)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !245, line: 25, baseType: !246)
!245 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !105, line: 40, baseType: !50)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !240, file: !241, line: 31, baseType: !244, size: 16, offset: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nqueries", scope: !240, file: !241, line: 32, baseType: !244, size: 16, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nanswers", scope: !240, file: !241, line: 33, baseType: !244, size: 16, offset: 48)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nauth", scope: !240, file: !241, line: 34, baseType: !244, size: 16, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nother", scope: !240, file: !241, line: 35, baseType: !244, size: 16, offset: 80)
!252 = !DILocalVariable(name: "name", scope: !167, file: !3, line: 118, type: !51)
!253 = !DILocalVariable(name: "block", scope: !167, file: !3, line: 124, type: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !57, line: 15, size: 512, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bitarray", scope: !255, file: !57, line: 16, baseType: !258, size: 512)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 512, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 64)
!261 = !DILocalVariable(name: "i", scope: !167, file: !3, line: 134, type: !53)
!262 = !DILocalVariable(name: "byte", scope: !167, file: !3, line: 135, type: !53)
!263 = !DILocalVariable(name: "prev_byte", scope: !167, file: !3, line: 136, type: !53)
!264 = !DILocalVariable(name: "prev_prev_byte", scope: !167, file: !3, line: 137, type: !53)
!265 = !DILocalVariable(name: "upper_16", scope: !167, file: !3, line: 138, type: !53)
!266 = !DILocalVariable(name: "lower_16", scope: !167, file: !3, line: 139, type: !53)
!267 = !DILocalVariable(name: "multiplier", scope: !167, file: !3, line: 140, type: !53)
!268 = !DILocalVariable(name: "h1", scope: !167, file: !3, line: 143, type: !53)
!269 = !DILocalVariable(name: "k", scope: !167, file: !3, line: 144, type: !53)
!270 = !DILocalVariable(name: "remains", scope: !167, file: !3, line: 191, type: !53)
!271 = !DILocalVariable(name: "tail0", scope: !167, file: !3, line: 192, type: !209)
!272 = !DILocalVariable(name: "tail1", scope: !167, file: !3, line: 193, type: !209)
!273 = !DILocalVariable(name: "tail2", scope: !167, file: !3, line: 194, type: !209)
!274 = !DILocalVariable(name: "n", scope: !167, file: !3, line: 229, type: !53)
!275 = !DILocalVariable(name: "hash1", scope: !167, file: !3, line: 231, type: !53)
!276 = !DILocalVariable(name: "fp", scope: !167, file: !3, line: 232, type: !209)
!277 = !DILocalVariable(name: "____fmt", scope: !278, file: !3, line: 233, type: !279)
!278 = distinct !DILexicalBlock(scope: !167, file: !3, line: 233, column: 2)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 48, elements: !190)
!280 = !DILocalVariable(name: "glbi1", scope: !167, file: !3, line: 235, type: !53)
!281 = !DILocalVariable(name: "block1", scope: !167, file: !3, line: 236, type: !53)
!282 = !DILocalVariable(name: "____fmt", scope: !283, file: !3, line: 260, type: !134)
!283 = distinct !DILexicalBlock(scope: !284, file: !3, line: 260, column: 3)
!284 = distinct !DILexicalBlock(scope: !285, file: !3, line: 259, column: 13)
!285 = distinct !DILexicalBlock(scope: !167, file: !3, line: 259, column: 6)
!286 = !DILocalVariable(name: "lbi1", scope: !167, file: !3, line: 275, type: !53)
!287 = !DILocalVariable(name: "ota_index", scope: !167, file: !3, line: 276, type: !50)
!288 = !DILocalVariable(name: "ota_bit", scope: !167, file: !3, line: 277, type: !50)
!289 = !DILocalVariable(name: "found", scope: !167, file: !3, line: 278, type: !50)
!290 = !DILocalVariable(name: "cap", scope: !167, file: !3, line: 281, type: !48)
!291 = !DILocalVariable(name: "bucket_capacities", scope: !167, file: !3, line: 282, type: !209)
!292 = !DILocalVariable(name: "index", scope: !167, file: !3, line: 283, type: !48)
!293 = !DILocalVariable(name: "cand_fp", scope: !167, file: !3, line: 285, type: !209)
!294 = !DILocalVariable(name: "temp_cap", scope: !167, file: !3, line: 286, type: !48)
!295 = !DILocalVariable(name: "i", scope: !296, file: !3, line: 288, type: !209)
!296 = distinct !DILexicalBlock(scope: !167, file: !3, line: 288, column: 2)
!297 = !DILocalVariable(name: "item", scope: !298, file: !3, line: 297, type: !209)
!298 = distinct !DILexicalBlock(scope: !299, file: !3, line: 289, column: 14)
