; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }

@morton_filter = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 64, i32 1, i32 0 }, section "maps", align 4, !dbg !0
@__const.xdp_morton_filter_func.____fmt = private unnamed_addr constant [16 x i8] c"found:%u, fp=%u\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !69
@llvm.compiler.used = appending global [3 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.bpf_map_def* @morton_filter to i8*), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_morton_filter_func to i8*)], section "llvm.metadata"

; Function Attrs: nounwind
define dso_local i32 @xdp_morton_filter_func(%struct.xdp_md* nocapture readonly %0) #0 section "xdp_morton_filter" !dbg !169 {
  %2 = alloca i32, align 4
  %3 = alloca [64 x i8], align 1
  %4 = getelementptr inbounds [64 x i8], [64 x i8]* %3, i64 0, i64 0
  %5 = alloca [16 x i8], align 1
  %6 = alloca i32, align 4
  call void @llvm.dbg.value(metadata %struct.xdp_md* %0, metadata !181, metadata !DIExpression()), !dbg !295

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 40, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48, !51}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!52 = !{!0, !53, !57, !59, !61, !63, !65, !67, !69, !75, !139, !141, !149}
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!54 = distinct !DIGlobalVariable(name: "NO_BLOCKS", scope: !2, file: !55, line: 6, type: !56, isLocal: true, isDefinition: true)
!55 = !DIFile(filename: "./morton_filter.h", directory: "/home/anastasia/diplomatiki/xdp_code/filters")
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression(DW_OP_constu, 64, DW_OP_stack_value))
!58 = distinct !DIGlobalVariable(name: "BUCKETS_PER_BLOCK", scope: !2, file: !55, line: 7, type: !56, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression(DW_OP_constu, 15, DW_OP_stack_value))
!60 = distinct !DIGlobalVariable(name: "OTA_BITS", scope: !2, file: !55, line: 8, type: !56, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression(DW_OP_constu, 368, DW_OP_stack_value))
!62 = distinct !DIGlobalVariable(name: "FSA_ARRAY_END", scope: !2, file: !55, line: 12, type: !56, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_constu, 128, DW_OP_stack_value))
!64 = distinct !DIGlobalVariable(name: "FCA_ARRAY_END", scope: !2, file: !55, line: 13, type: !56, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!66 = distinct !DIGlobalVariable(name: "FCA_BITS", scope: !2, file: !55, line: 9, type: !56, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression(DW_OP_constu, 46, DW_OP_stack_value))
!68 = distinct !DIGlobalVariable(name: "NO_FINGERPRINTS", scope: !2, file: !55, line: 10, type: !56, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 366, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !73)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !{!74}
!74 = !DISubrange(count: 4)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "stdin", scope: !2, file: !77, line: 137, type: !78, isLocal: false, isDefinition: false)
!77 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !80, line: 7, baseType: !81)
!80 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !82, line: 49, size: 1728, elements: !83)
!82 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!83 = !{!84, !86, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !108, !109, !111, !115, !118, !122, !125, !128, !129, !130, !134, !135}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !81, file: !82, line: 51, baseType: !85, size: 32)
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !81, file: !82, line: 54, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !81, file: !82, line: 55, baseType: !87, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !81, file: !82, line: 56, baseType: !87, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !81, file: !82, line: 57, baseType: !87, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !81, file: !82, line: 58, baseType: !87, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !81, file: !82, line: 59, baseType: !87, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !81, file: !82, line: 60, baseType: !87, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !81, file: !82, line: 61, baseType: !87, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !81, file: !82, line: 64, baseType: !87, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !81, file: !82, line: 65, baseType: !87, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !81, file: !82, line: 66, baseType: !87, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !81, file: !82, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !82, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !81, file: !82, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !81, file: !82, line: 72, baseType: !85, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !81, file: !82, line: 73, baseType: !85, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !81, file: !82, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !47)
!107 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !81, file: !82, line: 77, baseType: !50, size: 16, offset: 1024)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !81, file: !82, line: 78, baseType: !110, size: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !81, file: !82, line: 79, baseType: !112, size: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !81, file: !82, line: 81, baseType: !116, size: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !82, line: 43, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !81, file: !82, line: 89, baseType: !119, size: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 47, baseType: !121)
!121 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !81, file: !82, line: 91, baseType: !123, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !82, line: 37, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !81, file: !82, line: 92, baseType: !126, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !82, line: 38, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !81, file: !82, line: 93, baseType: !102, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !81, file: !82, line: 94, baseType: !46, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !81, file: !82, line: 95, baseType: !131, size: 64, offset: 1472)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !132, line: 46, baseType: !133)
!132 = !DIFile(filename: "/usr/lib/clang/13.0.0/include/stddef.h", directory: "")
!133 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !81, file: !82, line: 96, baseType: !85, size: 32, offset: 1536)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !81, file: !82, line: 98, baseType: !136, size: 160, offset: 1568)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 20)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "stdout", scope: !2, file: !77, line: 138, type: !78, isLocal: false, isDefinition: false)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !143, line: 33, type: !144, isLocal: true, isDefinition: true)
!143 = !DIFile(filename: "../libbpf/src/build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/anastasia/diplomatiki/xdp_code/filters")
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!46, !46, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !143, line: 152, type: !151, isLocal: true, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!85, !154, !51, null}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !157, line: 33, size: 160, elements: !158)
!157 = !DIFile(filename: "../libbpf/src/build/usr/include/bpf/bpf_helpers.h", directory: "/home/anastasia/diplomatiki/xdp_code/filters")
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !157, line: 34, baseType: !7, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !156, file: !157, line: 35, baseType: !7, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !156, file: !157, line: 36, baseType: !7, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !156, file: !157, line: 37, baseType: !7, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !156, file: !157, line: 38, baseType: !7, size: 32, offset: 128)
!164 = !{i32 7, !"Dwarf Version", i32 4}
!165 = !{i32 2, !"Debug Info Version", i32 3}
!166 = !{i32 1, !"wchar_size", i32 4}
!167 = !{i32 7, !"frame-pointer", i32 2}
!168 = !{!"clang version 13.0.0"}
!169 = distinct !DISubprogram(name: "xdp_morton_filter_func", scope: !3, file: !3, line: 53, type: !170, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !180)
!170 = !DISubroutineType(types: !171)
!171 = !{!85, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !174)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !6, line: 2857, baseType: !51, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !173, file: !6, line: 2858, baseType: !51, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !173, file: !6, line: 2859, baseType: !51, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !173, file: !6, line: 2861, baseType: !51, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !173, file: !6, line: 2862, baseType: !51, size: 32, offset: 128)
!180 = !{!181, !182, !183, !184, !198, !217, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !247, !248, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !261, !266, !267, !268, !269, !270, !275, !278, !279, !280, !282, !283, !284, !290, !291, !292, !293, !294}
!181 = !DILocalVariable(name: "ctx", arg: 1, scope: !169, file: !3, line: 53, type: !172)
!182 = !DILocalVariable(name: "data_end", scope: !169, file: !3, line: 60, type: !46)
!183 = !DILocalVariable(name: "data", scope: !169, file: !3, line: 61, type: !46)
!184 = !DILocalVariable(name: "eth", scope: !169, file: !3, line: 62, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !187, line: 165, size: 112, elements: !188)
!187 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!188 = !{!189, !194, !195}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !186, file: !187, line: 166, baseType: !190, size: 48)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 48, elements: !192)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !{!193}
!193 = !DISubrange(count: 6)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !186, file: !187, line: 167, baseType: !190, size: 48, offset: 48)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !186, file: !187, line: 168, baseType: !196, size: 16, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !197, line: 25, baseType: !48)
!197 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!198 = !DILocalVariable(name: "iph", scope: !169, file: !3, line: 75, type: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !201, line: 86, size: 160, elements: !202)
!201 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!202 = !{!203, !205, !206, !207, !208, !209, !210, !211, !212, !214, !216}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !200, file: !201, line: 88, baseType: !204, size: 4, flags: DIFlagBitField, extraData: i64 0)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !191)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !200, file: !201, line: 89, baseType: !204, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !200, file: !201, line: 96, baseType: !204, size: 8, offset: 8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !200, file: !201, line: 97, baseType: !196, size: 16, offset: 16)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !200, file: !201, line: 98, baseType: !196, size: 16, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !200, file: !201, line: 99, baseType: !196, size: 16, offset: 48)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !200, file: !201, line: 100, baseType: !204, size: 8, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !200, file: !201, line: 101, baseType: !204, size: 8, offset: 72)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !200, file: !201, line: 102, baseType: !213, size: 16, offset: 80)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !197, line: 31, baseType: !48)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !200, file: !201, line: 103, baseType: !215, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !197, line: 27, baseType: !51)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !200, file: !201, line: 104, baseType: !215, size: 32, offset: 128)
!217 = !DILocalVariable(name: "name", scope: !169, file: !3, line: 115, type: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 80, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 10)
!221 = !DILocalVariable(name: "i", scope: !169, file: !3, line: 124, type: !51)
!222 = !DILocalVariable(name: "byte", scope: !169, file: !3, line: 125, type: !51)
!223 = !DILocalVariable(name: "prev_byte", scope: !169, file: !3, line: 126, type: !51)
!224 = !DILocalVariable(name: "prev_prev_byte", scope: !169, file: !3, line: 127, type: !51)
!225 = !DILocalVariable(name: "upper_16", scope: !169, file: !3, line: 128, type: !51)
!226 = !DILocalVariable(name: "lower_16", scope: !169, file: !3, line: 129, type: !51)
!227 = !DILocalVariable(name: "multiplier", scope: !169, file: !3, line: 130, type: !51)
!228 = !DILocalVariable(name: "h1", scope: !169, file: !3, line: 133, type: !51)
!229 = !DILocalVariable(name: "k", scope: !169, file: !3, line: 134, type: !51)
!230 = !DILocalVariable(name: "remains", scope: !169, file: !3, line: 165, type: !51)
!231 = !DILocalVariable(name: "tail0", scope: !169, file: !3, line: 166, type: !204)
!232 = !DILocalVariable(name: "tail1", scope: !169, file: !3, line: 167, type: !204)
!233 = !DILocalVariable(name: "tail2", scope: !169, file: !3, line: 168, type: !204)
!234 = !DILocalVariable(name: "n", scope: !169, file: !3, line: 203, type: !51)
!235 = !DILocalVariable(name: "hash1", scope: !169, file: !3, line: 205, type: !51)
!236 = !DILocalVariable(name: "fp", scope: !169, file: !3, line: 206, type: !204)
!237 = !DILocalVariable(name: "glbi1", scope: !169, file: !3, line: 208, type: !51)
!238 = !DILocalVariable(name: "block1", scope: !169, file: !3, line: 209, type: !51)
!239 = !DILocalVariable(name: "block", scope: !169, file: !3, line: 211, type: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Block", file: !55, line: 15, size: 512, elements: !242)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bitarray", scope: !241, file: !55, line: 16, baseType: !244, size: 512)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 512, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 64)
!247 = !DILocalVariable(name: "b", scope: !169, file: !3, line: 220, type: !244)
!248 = !DILocalVariable(name: "i", scope: !249, file: !3, line: 229, type: !204)
!249 = distinct !DILexicalBlock(scope: !169, file: !3, line: 229, column: 2)
!250 = !DILocalVariable(name: "lbi1", scope: !169, file: !3, line: 240, type: !51)
!251 = !DILocalVariable(name: "ota_index", scope: !169, file: !3, line: 241, type: !50)
!252 = !DILocalVariable(name: "ota_bit", scope: !169, file: !3, line: 242, type: !50)
!253 = !DILocalVariable(name: "found", scope: !169, file: !3, line: 243, type: !50)
!254 = !DILocalVariable(name: "cap", scope: !169, file: !3, line: 246, type: !48)
!255 = !DILocalVariable(name: "bucket_capacities", scope: !169, file: !3, line: 247, type: !48)
!256 = !DILocalVariable(name: "index", scope: !169, file: !3, line: 248, type: !48)
!257 = !DILocalVariable(name: "cand_fp", scope: !169, file: !3, line: 250, type: !204)
!258 = !DILocalVariable(name: "temp_cap", scope: !169, file: !3, line: 251, type: !48)
!259 = !DILocalVariable(name: "i", scope: !260, file: !3, line: 253, type: !204)
!260 = distinct !DILexicalBlock(scope: !169, file: !3, line: 253, column: 2)
!261 = !DILocalVariable(name: "item", scope: !262, file: !3, line: 262, type: !204)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 254, column: 14)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 254, column: 7)
!264 = distinct !DILexicalBlock(scope: !265, file: !3, line: 253, column: 40)
!265 = distinct !DILexicalBlock(scope: !260, file: !3, line: 253, column: 2)
